
# Read the design
read_verilog -formal ../../rtl/coprocessor/scarv_cop_palu_adder.v

# Dump pre-synthesis schematic to file
show -format svg -prefix ../../work/adder-schematic-bhav

# Processes / generates into netlist
proc ;

# generic synthsis
synth;

# Dump post-synthesis schematic to file
show -format svg -prefix ../../work/adder-schematic-synth

# Dump SMT2 model
write_smt2 -wires ../../work/adder.smt2

# Print stats
stat -width;
